// Задача 10: Напишите программу, которая принимает на 
// вход трехзначное число и на выходе показывает вторую
// цифру этого числа
//  456 -> 5
//  782 -> 8
//  918 -> 1

Console.Clear();
Console.WriteLine("Введите первое число (трехзначное)");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число (трехзначное)");
int num2 = Convert.ToInt32(Console.ReadLine());






